<?php

	#Параметр md5 email адреса для доступа к сайту.
	define("EMAIL", "");

	#Параметр md5 пароля для доступа к панели управления.
	#password
	define("PASSWORD", "5f4dcc3b5aa765d61d8327deb882cf99");

	#Параметр корня сайта.
	define("ROOT", "");

	#Параметр названия сайта.
	define("TITLE", "Название сайта");

	#Параметр ключевого слова главной страницы.
	define("KEYWORD", "");

	#Параметр языка по умолчанию для парсинга.
	define("LANGUAGE", "ru");

	#Параметр названия шаблона.
	define("TEMPLATE", "default");

	#Параметр названия сниппет плагинов.
	define("SNIPPETS", "");

	#Параметр названия плагинов изображений.
	define("IMAGES", "");

	#Параметр названия видео плагинов.
	define("VIDEOS", "");

	#Параметр названия плагина пингования.
	define("PINGERS", "");

	#Параметр названия плагина комментариев.
	define("COMMENTS", "");

	#Параметр количества сниппетов для парсинга.
	define("COUNT_SNIPPETS", "10");

	#Параметр количества явных ссылок в заголовках сниппетов.
	define("COUNT_LINKS", "10");

	#Параметр количества кэш файлов метода хранения index.
	define("COUNT_FILES", "1000");

	#Параметр количества слов.
	define("WORDS", "4");

	#Параметр включения/выключения формирования явных ссылок в заголовках сниппетов: true | false.
	define("STOP_GROWING", "false");

	#Параметр определяющий метод формирования явных ссылок в заголовках сниппетов: true | false.
	define("SUBJECT_LIMITATION", "false");

	#Параметр формирования явных ссылок в заголовках сниппетов: true | false.
	define("ONLY_EXISTING_KEYWORDS", "true");

	#Параметр формирования внешней явной ссылки в заголовке последнего сниппета: true | false.
	define("EXTERNAL_LINKING", "false");

	#Параметр названия переменной контроллера.
	define("CONTROLLER", "c");

	#Параметр названия переменной контроллера результатов.
	define("RESULT", "r");

	#Параметр названия переменной запроса.
	define("QUERY", "q");

	#Параметр включения/выключения ЧПУ: OFF | ON.
	define("FU_STATUS", "OFF");

	#Параметр типа ЧПУ ссылки: FULL | RAND.
	define("FU_TYPE", "");

	#Параметр определяющий метод хранения кэш файлов: index | disc.
	define("CACHE", "index");

	# Параметр включения/выключения поддержки SEDv3.2 версии: true | false.
	define("SUPPORT_32", "false");

/* End of file config.php */